/**
 * @file	ArchiveFile.cpp
 * @brief	アーカイブファイルクラス実装
 * @author	morimoto
 */

//----------------------------------------------------------------------
// Include
//----------------------------------------------------------------------
#include "ArchiveFile.h"


namespace Game
{
	//----------------------------------------------------------------------
	// Static Private Variables
	//----------------------------------------------------------------------
	const size_t ArchiveFile::m_FileHeaderSize = 8;


	//----------------------------------------------------------------------
	// Constructor	Destructor
	//----------------------------------------------------------------------
	ArchiveFile::ArchiveFile()
	{
	}

	ArchiveFile::~ArchiveFile()
	{
	}
}
