/**
 * @file	EventBase.cpp
 * @brief	イベント基底クラス実装
 * @author	morimoto
 */

//----------------------------------------------------------------------
// Include
//----------------------------------------------------------------------
#include "EventBase.h"


namespace Lib
{
	//----------------------------------------------------------------------
	// Constructor	Destructor
	//----------------------------------------------------------------------
	EventBase::EventBase()
	{
	}

	EventBase::~EventBase()
	{
	}
}

