/**
 * @file	IAnimation.cpp
 * @brief	アニメーションインターフェース実装
 * @author	morimoto
 */

//----------------------------------------------------------------------
// Include
//----------------------------------------------------------------------
#include "IAnimation.h"


namespace Lib
{
	namespace Dx11
	{
		//----------------------------------------------------------------------
		// Constructor	Destructor
		//----------------------------------------------------------------------
		IAnimation::IAnimation()
		{
		}

		IAnimation::~IAnimation()
		{
		}
	}
}

