/**
 * @file	ITexture.cpp
 * @brief	テクスチャインターフェース実装
 * @author	morimoto
 */

//----------------------------------------------------------------------
// Include
//----------------------------------------------------------------------
#include "ITexture.h"


namespace Lib
{
	namespace Dx11
	{
		//----------------------------------------------------------------------
		// Constructor	Destructor
		//----------------------------------------------------------------------
		ITexture::ITexture()
		{
		}

		ITexture::~ITexture()
		{
		}
	}
}

